app/controllers/moves_controller.rb

SELECT * FROM "rounds" WHERE ("rounds"."id" = 71)
INSERT INTO "moves" ("x", "y", "by_player", "round_id", "created_at", "updated_at") VALUES(1, 1, 't', 71, '2010-01-31 21:25:49', '2010-01-31 21:25:49')
UPDATE "rounds" SET "state" = 1, "updated_at" = '2010-01-31 21:25:56' WHERE "id" = 71
---
  def create # {{{
    round = Round.find(@round_id)
    if round.compute_state == Round::RUNNING

      @move = Move.new(params[:move])

      @move.round_id = @round_id

      if @move.save
        # the state could have changed, because of the move added above by player
        if round.compute_state == Round::RUNNING
          ki = KI.new @round_id
          ki.move
        end
      end

    end # this stuff above should only be done, if the round is still running

    # update the state of the round whith the new computed status
    round.state = round.compute_state

    round.save