app/controllers/rounds_controller.rb

SELECT * FROM "rounds" WHERE ("rounds"."id" = 71)
---
  def show # {{{
    # crosschecks the given id to prevent abuse of the show-method
    # the RESTful urls create links, which sends the round_id.
    # TODO: KILLING this redundancy
    redirect_to rounds_url unless params[:id]!=session[:round_id]
    # this ^^

    @round = Round.find(params[:id])

INSERT INTO "rounds" ("player", "created_at", "updated_at", "state") VALUES('test', '2010-01-31 21:25:45', '2010-01-31 21:25:45', 0)
---
  def create # {{{
    @round = Round.new(params[:round])

    # the round must begin in a running-state! :)
    # Otherwise, it would never start
    @round.state = Round::RUNNING

    session[:round_id] = @round.id if @round.save

SELECT * FROM "rounds" WHERE ("rounds"."id" = 71)
DELETE FROM "rounds" WHERE "id" = 76
---
  def destroy # {{{
    @round = Round.find(params[:id])

    # the round needs only to be deleted, when its still running. An ended game
    # shall resist so it'll be viewable in the highscore-list
    @round.destroy if @round.state == Round::RUNNING