app/controllers/static_controller.rb

  def highscore
#    @rounds = Round.find(:all, :limit=>10, :conditions=>{:state => Round::WON}, :order => [":updated_at - :created_at"])
#    @rounds = Round.find_by_sql(
#      "SELECT player,updated_at AS duration
#       FROM rounds
#       ORDER BY duration
#       LIMIT 10")
    @rounds = Round.find(:all,:conditions=>{:state => Round::WON})
---
SELECT * FROM "rounds" WHERE ("rounds"."state" = 1)